#include <iostream>
using namespace std;

// 这个题似乎没用用到什么数论定理，可做w...首先a的开头数字只能<=b的开头数字，如果不这样a-b绝对会得到一个<=0的数字， 
// 例如29 - 30（2是bd，3是ad）这种..另外ad和bd的差值应该也是<=1的，试想ad = 2,bd = 4,这样的话两者的差绝对会大于1，
// 例如40 - 29...那么这就是两种无解的情况，接下来看下有解的情况，有解也有两种情况，情况一：ad == bd，这种情况ad后面
// 跟一个比bd小1的数字就行，比如31 - 30，注意bd后面的数字至少要>=1；情况二：bd - ad == 1，这种情况就是bd后面跟0，ad
// 后面跟9就行了... 

int main() {
	int a, b;
	cin >> a >> b;
	if (b - a < 0 || b - a > 1) {
		// 注意这里要加个特判，当a == 9，b == 1时，b可以变成10... 
		if (b == 1 && a == 9) {
			cout << a << ' ' << b << 0 << endl;
			return 0;
		}
		cout << -1 << endl;
		return 0;
	}
	if (b - a == 1) cout << a << 9 << ' ' << b << 0;
	else cout << a << 0 << ' ' << b << 1;
	cout << endl;
	return 0;
}
